clemenspeters.format-json@1.0.3
donjayamanne.githistory@0.6.20
esbenp.prettier-vscode@11.0.0
gamemodeone.json-compact-prettier@4.0.0
gingerturtle.html-preview-pro@1.0.5
github.copilot@1.372.0
github.copilot-chat@0.31.1
github.vscode-github-actions@0.27.2
google.gemini-cli-vscode-ide-companion@0.4.0
h5web.vscode-h5web@0.2.0
henoc.svgeditor@2.9.0
humao.rest-client@0.25.1
james-yu.latex-workshop@10.10.2
julialang.language-julia@1.149.2
lochbrunner.vscode-hdf5-viewer@0.0.3
lucas-rezende.greek-alphabet-snippets@0.0.3
mathematic.vscode-latex@1.3.0
mechatroner.rainbow-csv@3.21.0
mkhl.direnv@0.17.0
ms-azuretools.vscode-containers@2.1.0
ms-azuretools.vscode-docker@2.0.0
ms-kubernetes-tools.vscode-kubernetes-tools@1.3.26
ms-python.black-formatter@2025.2.0
ms-python.debugpy@2025.10.0
ms-python.python@2025.14.0
ms-python.vscode-pylance@2025.8.2
ms-python.vscode-python-envs@1.8.0
ms-toolsai.jupyter@2025.8.0
ms-toolsai.jupyter-keymap@1.1.2
ms-toolsai.jupyter-renderers@1.3.0
ms-toolsai.vscode-jupyter-cell-tags@0.1.9
ms-toolsai.vscode-jupyter-slideshow@0.1.6
ms-vscode-remote.remote-containers@0.427.0
ms-vscode.makefile-tools@0.12.17
mtxr.sqltools@0.28.5
redhat.vscode-yaml@1.18.0
simonsiefke.svg-preview@2.8.3
tamasfe.even-better-toml@0.21.2
tomoki1207.pdf@1.2.2
tshort.language-opendss@0.1.1
